In [34]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

Intro To DataFrames

In [35]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]], columns=["A", "B", "C"], index=["r1", "r2", "r3", "r4"])

df.head(2)

    A  B  C
r1  1  2  3
r2  4  5  6

In [36]:
df.tail(3)

     A   B   C
r2   4   5   6
r3   7   8   9
r4  10  11  12

In [37]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [38]:
df.index.tolist()

['r1', 'r2', 'r3', 'r4']

In [39]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, r1 to r4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [40]:
df.shape #jumlah (baris, kolom)

(4, 3)

In [41]:
df.size #jumlah elemen yang ada dalam dataframe

12

In [42]:
df.nunique() #jumlah nilai unik perkolom

A    4
B    4
C    4
dtype: int64

In [43]:
df['A'].unique() #Menampilkan nilai unik pada kolom A -> output berupa array NumPy

array([ 1,  4,  7, 10])

In [44]:
df

     A   B   C
r1   1   2   3
r2   4   5   6
r3   7   8   9
r4  10  11  12

Loading in DataFrame from Files

In [45]:
coffee = pd.read_csv('./data/coffee.csv')
bios = pd.read_csv('./data/bios.csv')
result = pd.read_parquet('./data/results.parquet')
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name="results")

Accessing Data with Pandas

In [46]:
print(coffee)
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [47]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [48]:
coffee.tail(2)

       Day Coffee Type  Units Sold
12  Sunday    Espresso          45
13  Sunday       Latte          35

In [49]:
coffee.sample(3)

        Day Coffee Type  Units Sold
6  Thursday    Espresso          40
8    Friday    Espresso          45
1    Monday       Latte          15

In [ ]:
#loc
#Coffee.loc[Rows, Columns]
coffee.loc[1]

Day            Monday
Coffee Type     Latte
Units Sold         15
Name: 1, dtype: object

In [ ]:
#indexing loc tergantung label indexnya
new_coffee = coffee.set_index("Day")
new_coffee.loc[["Monday","Sunday"]]

       Coffee Type  Units Sold
Day
Monday    Espresso          25
Monday       Latte          15
Sunday    Espresso          45
Sunday       Latte          35

In [56]:
coffee.loc[5:9, ["Day", "Units Sold"]]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45
9     Friday          35

In [ ]:
#indexing iloc tergantung posisi baris
coffee.iloc[0:5, [0,2]]

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [60]:
coffee.loc[5:9, ["Day", "Units Sold"]]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45
9     Friday          35

In [61]:
coffee.loc[[0,10,12]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
10  Saturday    Espresso          45
12    Sunday    Espresso          45